name: "deeplabv3_preprocess"
backend: "python"
max_batch_size: 128
default_model_filename: "preprocess.py"

input [
    {
        name: "RAW_IMAGE"
        data_type: TYPE_STRING
        dims: [ 1 ]
    }
]
output [
    {
        name: "PREPROCESSED_IMAGE"
        data_type: TYPE_FP32
        dims: [ 3, 512, 512 ]
    },
    {
        name: "IMAGE_SHAPE"
        data_type: TYPE_INT64
        dims: [ 2 ]
    }
]

instance_group [
  {
    count: 32
    kind: KIND_CPU
  }
]