name: "deeplabv3_postprocess"
backend: "python"
max_batch_size: 128
default_model_filename: "postprocess.py"

input [
    {
        name: "MASKS"
        data_type: TYPE_FP32
        dims: [-1, -1, -1]
    },
    {
        name: "IMAGE_SHAPE"
        data_type: TYPE_INT64
        dims: [ 2 ]
    }
]

output [
    {
        name: "OUTPUT_RESULTS"
        data_type: TYPE_STRING
        dims: [ 1 ]
    }
]


instance_group [
  {
    count: 32
    kind: KIND_CPU
  }
]