name: "resnet50_inference"
# backend: "onnxruntime"
# default_model_filename: "resnet50_imagenet_v2.onnx"
backend: "tensorrt"
default_model_filename: "resnet50_imagenet_v2_fp16.plan"
max_batch_size: 256
dynamic_batching {
  max_queue_delay_microseconds: 100000
  preferred_batch_size: [ 16, 32, 64, 128, 256 ]
}

input [
  {
    name: "input"
    data_type: TYPE_FP32
    dims: [3, 224, 224]  # 固定输入尺寸，NCHW 格式
  }
]

output [
  {
    name: "output"
    data_type: TYPE_FP32
    dims: [1000]  # 输出维度，[batch, 1000类别]
  }
]

instance_group [
  {
    count: 1
    kind: KIND_GPU
    gpus: [0]  # 使用第 0 号 GPU
  }
]