name: "yolov26_preprocess"
backend: "python"
max_batch_size: 64
default_model_filename: "preprocess.py"

input [
  {
    name: "RAW_IMAGE"
    data_type: TYPE_STRING
    dims: [ 1 ]
  }
]

output [
  {
    name: "PREPROCESSED_IMAGE"
    data_type: TYPE_FP32
    dims: [ 3, 640, 640 ]
  },
  {
    name: "IMAGE_SHAPE"
    data_type: TYPE_INT32
    dims: [ 2 ]
  },
  {
    name: "SCALE"
    data_type: TYPE_FP32
    dims: [ 1 ]
  },
  {
    name: "PADDING"
    data_type: TYPE_FP32
    dims: [ 2 ]
  }
]

instance_group [
  {
    count: 2
    kind: KIND_CPU
  }
]